clc;clear;
%逻辑回归模型
data=[-62.8 -89.5 1.7
    3.3 -3.5 1.1
    -120.8 -103.2 2.5
    -18.1 -28.8 1.1
    -3.8 -50.6 0.9
    -61.2 -56.2 1.7
    -20.3 -17.4 1
    -194.5 -25.8 0.5
    20.8 -43 1
    -106.1 -22.9 1.5
    43 16.4 1.3
    47 16 1.9
    -3.3 4 2.7
    35 20.8 1.9
    46.7 12.6 0.9
    20.8 12.5 2.4
    33 23.6 1.5
    26.1 10.4 2.1
    68.6 13.8 1.6
    37.3 33.4 3.5
    ];

X1=ones(size(data,1),1);%构建常数项系数(因为regress函数输入需要一个常数项,此设1
X=[X1,data];

%以下是训练标签
Y0_1=zeros(10,1);
Y0_2=ones(10,1);
Y0=[Y0_1;Y0_2];
n=size(Y0(:,1));
%n=20;
Y1=zeros(20,1);
for i=1:n
    if Y0(i)==0
        Y1(i,1)=0.25;
    else
        Y1(i,1)=0.75;
    end
end 

%对概率P进行变换后就可以进行线性回归了
Y=log(Y1./(1-Y1));
%回归
b=regress(Y,X);


%模型验证
%测试数据
XE=[-49.2 -17.2 0.3
    -19.2 -36.7 0.8
    40.6 5.8 1.8
    34.6 26.4 1.8
    19.9 26.7 2.3];
P=zeros(5,1);
%验证数据
for i=1:size(XE,1)
    tem=b(1)+b(2)*XE(i,1)+b(3)*XE(i,2)+b(4)*XE(i,3);
    Pai0=exp(tem)/(1+exp(tem));
    if Pai0<0.5
        P(i,1)=0;
    else
        P(i,1)=1;
    end
end
disp(['回归系数为:',num2str(b')]);
disp(['预测结果为:',num2str(P')]);